import re
from typing import List

from parser_vendor_code.vendors import interface

# "МС 100/40x200-3.04.3.AT(100)(01)"
TEMPLATE_PARTS = [
    r"(?P<series>[a-zA-Zа-яА-я]+)",
    r"\s+",
    r"(?P<D>\d+)",
    r"\/",
    r"(?P<d>\d+)",
    r"x",
    r"(?P<S>\d+)",
    r"-",
    r"(?P<pressure>\d+)",
    r".",
    r"(?P<attachment>\d+)",
    r".",
    r"(?P<working_fluid>\d+)",
    r".?",
    r"(?P<hydraulic_cylinder>A|K|C|F|D|РТ)?",
    r"(?P<climatic>T|YXL|XL)?",
    r"\(",
    r"(?P<center_distance>\d+)",
    r"\)",
    r"\(?",
    r"(?P<supply_hydraulic_cylinders>\d+)?",
    r"\)?",
]
TEMPLATE = r"\s*".join(TEMPLATE_PARTS)
PATTERN = re.compile(TEMPLATE)

SERIES = {
    "C": "Серия поршневых одноступенчатых гидроцилиндров на шпильках (болтах)",
    "MC": "Серия поршневых одноступенчатых гидроцилиндров",
    "МСP": "Серия плунжерных одноступенчатых гидроцилиндров",
}

PRESSURES = {
    "3": "16 МПа",
    "4": "20 МПа",
    "5": "25 МПа",
    "6": "28 МПа",
}

HYDRAULIC_CYLINDERS = {
    "A": "наличие механического ограничителя хода поршня",
    "K": "возможность регулировки межцентрового расстояния",
    "C": "с замедлительным клапаном",
    "F": "фланцевое крепление крышки передней",
    "PT": "гидроцилиндр плуга оборотного",
    "D": "наличие демпферного устройства",
    None: "",
}

CLIMATIC = {
    "T": "тропический климат",
    "YXL": "умеренно-холодный климат",
    "XL": "холодный климат",
    None: "умеренный климат",
}

ATTACHMENTS = {
    "00": "Корпус и шток с подготовленными концами под сварку",
    "01": "Корпус с подготовкой конца под сварку и проушина с шарнирным подшипником на штоке",
    "02": "Корпус с подготовкой конца под сварку и шток с проушиной",
    "04": "Корпус с подготовкой конца под сварку и шток с вилкой",
    "05": "Корпус с подготовкой конца под сварку и шток с резьбой",
    "07": "Корпус с подготовкой конца под сварку и шток с разъемной головкой",
    "08": "Корпус с подготовкой конца под сварку и шток со сферой или грибком",
    "09": "Корпус с подготовкой конца под сварку и шток с фланцем",
    "10": "Проушина с шарнирным подшипником на корпусе и шток с подготовкой конца под сварку",
    "11": "Проушины с шарнирным подшипником на корпусе и штоке",
    "12": "Проушина с шарнирным подшипником на корпусе и шток с проушиной",
    "14": "Проушина с шарнирным подшипником на корпусе и шток с вилкой",
    "15": "Проушина с шарнирным подшипником на корпусе и шток с резьбой",
    "17": "Проушина с шарнирным подшипником на корпусе и шток с разъемной головкой",
    "18": "Проушина с шарнирным подшипником на корпусе и шток со сферой или грибком",
    "19": "Проушина с шарнирным подшипником на корпусе и шток с фланцем",
    "20": "Проушина на корпусе и шток с подготовкой конца под сварку",
    "21": "Проушина на корпусе и шарнирный подшипник на штоке",
    "22": "Проушины на корпусе и штоке",
    "24": "Проушина на корпусе и шток с вилкой",
    "25": "Проушина на корпусе и шток с резьбой",
    "27": "Проушина на корпусе и шток с разъемной головкой",
    "28": "Проушина на корпусе и шток со сферой или грибком",
    "29": "Проушина на корпусе и шток с фланцем",
    "30": "Корпус на цапфах и шток с подготовкой конца под сварку",
    "31": "Корпус на цапфах и проушина с шарнирным подшипником на штоке",
    "32": "Корпус на цапфах и проушина на штоке",
    "34": "Корпус на цапфах и шток с вилкой",
    "35": "Корпус на цапфах и шток с резьбой",
    "37": "Корпус на цапфах и шток с разъемной головкой",
    "38": "Корпус на цапфах и шток со сферой или грибком",
    "39": "Корпус на цапфах и шток с фланцем",
    "40": "Вилка на корпусе и шток с подготовкой конца под сварку",
    "41": "Вилка на корпусе и проушина с шарнирным подшипником на штоке",
    "42": "Вилка на корпусе и проушина на штоке",
    "44": "Вилка на корпусе и штоке",
    "45": "Вилка на корпусе и шток с резьбой",
    "47": "Вилка на корпусе и шток с разъемной головкой",
    "48": "Вилка на корпусе и шток со сферой или грибком",
    "49": "Вилка на корпусе и шток с фланцем",
    "50": "Корпус с резьбой и шток с подготовкой конца под сварку",
    "51": "Корпус с резьбой и проушина с шарнирным подшипником на штоке",
    "52": "Корпус с резьбой и проушина на штоке",
    "54": "Корпус с резьбой и шток с вилкой",
    "55": "Корпус с резьбой и шток с резьбой",
    "57": "Корпус с резьбой и шток с разъемной головкой",
    "58": "Корпус с резьбой и шток со сферой или грибком",
    "59": "Корпус с резьбой и шток с фланцем",
    "70": "Корпус с разъемной проушиной и шток с подготовкой конца под сварку",
    "71": "Корпус с разъемной проушиной и проушина с шарнирным подшипником на штоке",
    "72": "Корпус с разъемной проушиной и проушина на штоке",
    "74": "Корпус с разъемной проушиной и шток с вилкой",
    "75": "Корпус с разъемной проушиной и шток с резьбой",
    "77": "Корпус с разъемной проушиной и шток с разъемной проушиной",
    "78": "Корпус с разъемной проушиной и шток со сферой или грибком",
    "79": "Корпус с разъемной проушиной и шток с фланцем",
    "80": "Корпус со сферой или грибком и шток с подготовкой конца под сварку",
    "81": "Корпус со сферой или грибком и проушина с шарнирным подшипником на штоке",
    "82": "Корпус со сферой или грибком и проушина на штоке",
    "84": "Корпус со сферой или грибком и шток с вилкой",
    "85": "Корпус со сферой или грибком и шток с резьбой",
    "87": "Корпус со сферой или грибком и шток с разъемной проушиной",
    "88": "Корпус со сферой или грибком и шток со сферой или грибком",
    "89": "Корпус со сферой или грибком и шток с фланцем",
    "90": "Корпус с фланцем и шток с подготовкой конца под сварку",
    "91": "Корпус с фланцем и проушина с шарнирным подшипником на штоке",
    "92": "Корпус с фланцем и проушина на штоке",
    "94": "Корпус с фланцем и шток с вилкой",
    "95": "Корпус с фланцем и шток с резьбой",
    "97": "Корпус с фланцем и шток с разъемной проушиной",
    "98": "Корпус с фланцем и шток со сферой или грибком",
    "99": "Корпус с фланцем и шток с фланцем",
}

SUPPLY_HYDRAULIC_CYLINDERS = {
    "A": "наличие механического ограничителя хода поршня",
    "K": "возможность регулировки межцентрового расстояния",
    "C": "с замедлительным клапаном",
    "F": "фланцевое крепление крышки передней",
    "PT": "гидроцилиндр плуга оборотного",
    "D": "наличие демпферного устройства",
    None: "",
}


def parse(text: str) -> List[interface.Item]:
    match = re.match(PATTERN, text)
    results = []
    if not match:
        return results
    value = match.group("series")
    results.append(
        interface.Item(
            name="series",
            value=value,
            description=SERIES.get(value, value),
        ),
    )

    value = match.group("D")
    results.append(
        interface.Item(
            name="D",
            value=value,
            description=f"диаметр поршня {value} мм",
        ),
    )

    value = match.group("d")
    results.append(
        interface.Item(
            name="d",
            value=value,
            description=f"диаметр штока {value} мм",
        ),
    )

    value = match.group("S")
    results.append(
        interface.Item(
            name="S",
            value=value,
            description=f"ход поршня {value} мм",
        ),
    )

    value = match.group("pressure")
    results.append(
        interface.Item(
            name="pressure",
            value=value,
            description=f"номинальное давление {PRESSURES.get(value, '???')} бар",
        )
    )

    value = match.group("attachment")
    results.append(
        interface.Item(
            name="attachment",
            value=value,
            description=ATTACHMENTS.get(value, "???"),
        )
    )

    value = match.group("working_fluid")
    results.append(
        interface.Item(
            name="working_fluid",
            value=value,
            description=f"Исполнение по подводу рабочей жидкости",
        )
    )

    value = match.group("hydraulic_cylinder")
    results.append(
        interface.Item(
            name="hydraulic_cylinder",
            value=value,
            description=HYDRAULIC_CYLINDERS.get(value, "???"),
        )
    )

    value = match.group("climatic")
    results.append(
        interface.Item(
            name="climatic",
            value=value,
            description=CLIMATIC.get(value, "???"),
        )
    )

    value = match.group("center_distance")
    results.append(
        interface.Item(
            name="center_distance",
            value=value,
            description=f"межцентровое расстояние {value} мм",
        )
    )

    value = match.group("supply_hydraulic_cylinders")
    results.append(
        interface.Item(
            name="supply_hydraulic_cylinders",
            value=value,
            description=SUPPLY_HYDRAULIC_CYLINDERS.get(value, "???"),
        )
    )

    return results
